const destinyNumbers = [
    {
        number: 1,
        description: "Людина з числом долі 1 має сильну вольову силу та лідерські здібності. Вони часто виявляють незалежність, рішучість та самодостатність. Їм властиві високі стандарти і амбітції, і вони можуть бути успішними в будь-якій сфері, де можуть проявити свої лідерські якості.",
        advantages: "самостійність, впевненість, лідерські здібності",
        disadvantages: "впертість, несхильність до самовпевненості",
        suitableProfessions: "менеджер, лідер проекту, підприємець",
        compatibility: "найкраще сумісні з числом долі 1 або 5"
    },
    {
        number: 2,
        description: "Людина з числом долі 2 має вроджену схильність до співпраці та гармонії. Вони є відданими, доброзичливими та розуміють значення рівноваги. Такі люди часто виявляють талант у вирішенні конфліктів та спілкуванні з іншими.",
        advantages: "співпраця, відданість, гармонія",
        disadvantages: "не впевненість у собі, неспроможність приймати рішення",
        suitableProfessions: "посередник, консультант, психолог",
        compatibility: "найкраще сумісні з числом долі 2 або 6"
    },
    {
        number: 3,
        description: "Людина з числом долі 3 має творчу натуру та виразний хист до висловлювання. Вони є життєрадісними, комунікабельними та енергійними. Такі люди вміють розповідати історії та вражати оточуючих своїм харизматичним способом спілкування.",
        advantages: "творчість, комунікативність, харизма",
        disadvantages: "розсіяність, нестійкість у вирішенні завдань",
        suitableProfessions: "артист, письменник, викладач",
        compatibility: "найкраще сумісні з числом долі 3 або 5"
    },
    {
        number: 4,
        description: "Людина з числом долі 4 має вроджену схильність до систематизації та організації. Вони є практичними, стабільними та надійними. Такі люди вміють створювати структуру та порядок, і їх характеризує розсудливість та відповідальність.",
        advantages: "організованість, стабільність, розсудливість",
        disadvantages: "заперечливість, нестямність до змін",
        suitableProfessions: "архітектор, інженер, бухгалтер",
        compatibility: "найкраще сумісні з числом долі 2 або 8"
    },
    {
        number: 5,
        description: "Людина з числом долі 5 має незалежний та пригодницький характер. Вони є любителями свободи, руху та різноманітності. Такі люди завжди в пошуку нових вражень та досліджень, і їх характеризує відчуття свободи і незалежності.",
        advantages: "авантюризм, свобода, гнучкість",
        disadvantages: "нестійкість, нездатність до стабільності",
        suitableProfessions: "журналіст, мандрівник, дослідник",
        compatibility: "найкраще сумісні з числом долі 1 або 9"
    },
    {
        number: 6,
        description: "Людина з числом долі 6 має сильну сімейну та соціальну спрямованість. Вони є затишними, відданими та згуртованими людьми. Такі люди віддані своїй сім'ї та готові зробити багато для благополуччя інших.",
        advantages: "сімейність, відданість, згуртованість",
        disadvantages: "перейнятість, перфекціонізм",
        suitableProfessions: "педагог, консультант з сімейних відносин, соціальний працівник",
        compatibility: "найкраще сумісні з числом долі 3 або 9"
    },

    {
        number: 7,
        description: "Людина з числом долі 7 має аналітичний та дослідницький розум. Вони є мислителями, філософами та дослідниками. Такі люди захоплені поглибленим вивченням істини та розумінням глибоких концепцій.",
        advantages: "аналітичність, філософський розум, дослідницький підхід",
        disadvantages: "схильність до віддаленості, ізольованість",
        suitableProfessions: "науковець, філософ, дослідник",
        compatibility: "найкраще сумісні з числом долі 5 або 8"
    },
    {
        number: 8,
        description: "Людина з числом долі 8 має сильну схильність до досягнення успіху та матеріального благополуччя. Вони є амбітними, енергійними та цілеспрямованими. Такі люди готові вкласти багато зусиль у досягнення своїх цілей.",
        advantages: "амбітність, енергійність, фінансовий успіх",
        disadvantages: "недостатність розвиненої емоційної сторони, підвладність стресу",
        suitableProfessions: "бізнесмен, інвестор, керівник",
        compatibility: "найкраще сумісні з числом долі 4 або 6"
    },
    {
        number: 9,
        description: "Людина з числом долі 9 має глибоке розуміння і мудрість. Вони є духовними, милосердними та відданими. Такі люди мають потужну інтуїцію та здатність до сприйняття глибшого значення речей.",
        advantages: "духовність, мудрість, милосердя",
        disadvantages: "чутливість до емоційного виснаження, схильність до самозжертви",
        suitableProfessions: "духовний лідер, радник, вчитель",
        compatibility: "найкраще сумісні з числом долі 3 або 6"
    }
];